[
  {
    "id": "materi-dasar-1",
    "nama_materi": "Apa itu Pemrograman Mobile?",
    "materi": "<div> <p>Pemrograman mobile merupakan gabungan antara kata ” pemrograman ” dan ” mobile “.</p> </div> <div> <p>Istilah lainnya yaitu mobile programming.</p> </div> <div> <p>Pemrograman ini secara singkat memiliki makna proses menulis kode-kode program untuk membuat aplikasi yang ditujukan untuk perangkat bergerak (Mobile). </p> </div> <div> <p>Jadi berbagai jenis aplikasi smartphone yang kita pakai setiap hari merupakan hasil akhir dari pemrograman mobile. </p> </div> <div> <p>Orang yang membuatnya disebut Mobile Developer, baik itu mobile android developer atau mobile iOS developer.</p> </div>"
  },
  {
    "id": "materi-dasar-2",
    "nama_materi": "Macam-Macam Perangkat Mobile",
    "materi": " <div> <p>Ada beberapa macam perangkat yang termasuk ke dalam perangkat mobile.</p> </div> <div> <p>Smartphone bukanlah satu-satunya perangkat mobile.</p> </div> <div> <p>Kata mobile disini memiliki arti ” perangkat komputer yang dapat dengan mudah digenggam oleh penggunanya “.</p> </div> <div> <p>Perangkat mobile sengaja dibuat dengan tujuan agar mudah dibawa kemanapun (Portable).</p> </div> <div> <p>Adapun macam-macam perangkat mobile yaitu :</p> </div> <div> <ul> <li>Handphone / Smartphone : Saat ini smartphone paling populer yaitu smartphone yang menggunakan sistem operasi android sedangkan iOS berada di urutan kedua setelah android.</li> <li>Komputer Tablet : Meskipun saat ini tablet tidak sepopuler smartphone, masih banyak orang yang menggunakan tablet untuk menunjang pekerjaannya atau kegiatan sehari-hari.</li> <li>Alat baca elektronik (E Reader) : Salah satu dari e-reader adalah kindle dari amazon. Dari dulu sampai sekarang kindle masih menjadi e-reader yang paling populer, meskipun ada e-reader dari vendor-vendor lainnya.</li> <li>Smartwatch : Banyak orang kini sudah menggunakan jam tangan pintar. Meskipun kecil smartwatch sudah menggunakan mobile operating sistem seperti android dan iOS.</li> </ul> </div> "
  },
  {
    "id": "materi-dasar-3",
    "nama_materi": "Sistem Operasi atau OS Mobile",
    "materi": " <div> <p>Sistem Operasi Mobile (Mobile Operating System) yaitu perangkat lunak utama yang melakukan control terhadap perangkat mobile.</p> </div> <div> <p>OS ini memiliki banyak fungsi dan fitur seperti keyboard, email, sinkronisasi, memutar musik, kamera dan banyak lagi lainnya.</p> </div> <div> <p>Beberapa sistem operasi mobile yang populer yaitu :</p> </div> <div> <p> <ul> <li>Android : Sistem operasi android saat ini menduduki puncak paling atas dibandingkan dengan sistem operasi mobile yang lainnya. OS Android berada di bawah naungan Google, dimana android.inc (perusahaan pertama android) telah diakuisisi oleh Google dengan nilai dan fantastis. Hampir semua vendor smartphone besar dan terkenal sekarang menggunakan OS Android untuk mendukung perangkat smartphone mereka.</li> <li>iOS : Iphone, Ipod, dan Apple TV menggunakan sistem operasi iOS. iOS merupakan sistem operasi yang diciptakan dan dikembangkan oleh perusahaan Apple. Sistem operasi ini cukup eksklusif, dimana hanya perangkat-perangkat dari Apple lah yang menggunakannya.</li> <li>RIM (Blackberry) : Masih ingat kenangan menggunakan smartphone Blackberry ? Nah inilah sistem operasi yang digunakan, nama lainnya adalah BlackBerry OS. Dikembangkan oleh RIM yang mendukung layanan multitasking untuk produk-produk BlackBerry. Namun kepopuleran blackberry turun saat OS Android hadir. Salah satu penyebabnya karena aplikasi yang tersedia di Blackberry tidak sebanyak di smartphone yang menggunakan OS Android.</li> <li>Windows Phone : Windows phone atau windows mobile adalah OS yang dikembangkan oleh perusahaan Microsoft. OS ini dibuat untuk smartphone dan perangkat nirkabel lainnya. Dulu smartphone Nokia pernah menggunakan OS dari Windows, tepatnya Nokia Lumia.</li> </ul> </p> </div> "
  },
  {
    "id": "materi-dasar-4",
    "nama_materi": "Jenis Bahasa Pemrograman yang digunakan",
    "materi": " <div> <p> Tidak semua bahasa pemrograman bisa kita gunakan untuk membuat aplikasi mobile. </p> </div> <div> <p>Nah berikut ini adalah bahasa-bahasa pemrograman yang bisa kita pakai untuk membuat aplikasi mobile, yaitu :</p> </div> <div> <ul> <li>Untuk membuat aplikasi mobile android kita bisa menggunakan bahasa pemrograman : Java, Kotlin, dan C++</li> <li>Jika kita ingin membuat aplikasi mobile untuk perangkat iOS bahasa pemrograman yang bisa kita gunakan adalah : Swift dan Objective C</li> <li>Bahasa C# bisa kita gunakan untuk membuat aplikasi untuk perangkat mobile windows.</li> <li>Sedangkan jika kita ingin membuat aplikasi untuk dua perangkat sekaligus seperti android dan iOS istilah lainnya cross platform kita bisa menggunakan bahasa pemrograman JavaScript, TypeScript, dan Dart. Tentunya dengan menggunakan framework-framwork yang sudah disediakan seperti : React Native, Flutter, dan lainnya.</li> </ul> </div> "
  }
]